app/Models/modeloExamen.php

    public function insertarDatos($data)
    {
        $this->db->table('tbl_productos')->insert($data);
---
INSERT INTO `tbl_productos` (`PROD_NOMBRE`, `PROD_CODIGO`, `CAT_ID`, `PROV_ID`, `PROD_ESTADO`) VALUES ('Marco', '6969', '1', '1', '1')